package linkedLists;

import java.util.LinkedList;
import java.util.Scanner;

public class moveTheElementKPositions {

    public static void main (String [] args) {

        Scanner sc = new Scanner (System.in);
        int n = sc.nextInt();
        int k = sc.nextInt();
        int theChosenOne = sc.nextInt(); // елементот
        int idx = -1;

        LinkedList<Integer> list = new LinkedList<Integer>();
        for (int i = 0; i < n; i++)
            list.add(sc.nextInt());

        System.out.println(list);

        for (int i = 0; i < n; i++)
            if (list.get(i) == theChosenOne)
                idx = i; // индексот на елементот

        if (idx - k >= 0) {
            list.remove(idx); // нема да ги смени индексите лево од таа позиција
            list.add(idx - k, theChosenOne);
        }
        else {
            int fromEnd = (idx - k) + (list.size());
            list.add(fromEnd, theChosenOne);
            list.remove(idx);
        }

        System.out.println(list);

        // Задачата ја решив иако ја нема во учебникот.
        // Оваа задача ми се падна на лабораториски
        // вежби по предметов, но таму требаше да користам DLL.
        // Се внесува големина на листата, колку поместувања сакам
        // и кој е елементот кој што треба да го поместам.
        // Прво го барам кој е индексот на елементот којшто треба да го поместувам
        // и сфаќам дека има две можни сценарија.

        // Индексот на елементот минус поместувањата (треба во лево да поместувам)
        // може да е поголемо или еднакво на нула или пак помало од нула (негативна)

        // Доколку е поголемо или еднакво на нула, прво го бришам елементот од неговата позиција
        // (тоа нема да ги смени индексите на елементите лево од него) и потоа
        // со add методата, го ставам елементот каде што треба да биде (поместен во лево)
        // Доколку е помало од нула или негативно,
        // ја пресметувам разликата и ја додавам на големината на листата
        // (бидејќи е негативна вредноста, технички ја одземам од големината на листата)
        // Тоа мене ќе ми биде новиот индекс каде што треба да го ставам елементот
        // Прво го ставам елементот, па го бришам
        // (ако прво го избришам, ќе ги помести индексите на елементите десно од него)



    }

}
